Revit 2024 API
Wall.CurtainGrid Property
 Get the grid object of a curtain wall
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurtainGrid CurtainGrid { get; }
Visual Basic
Public ReadOnly Property CurtainGrid As CurtainGrid
	Get
Visual C++
public:
property CurtainGrid^ CurtainGrid {
	CurtainGrid^ get ();
}
Remarks
 This property is readonly.
See Also
Wall Class
Autodesk.Revit.DB Namespace